const STORY = `在一个宁静的海域，三个岛屿共同构成了一个迷人的世界。
主岛是地区的核心，资源丰富，产业多样；东侧的生态岛以可持续发展为核心，注重环保科研；而矿岛则依赖金矿开采为主产业。
三岛之间通过航线紧密联系，互通物资与文化。

在这个模拟经营游戏中，玩家将扮演富有远见的领导者，负责经营这片土地的产业与资源。
主岛上设施齐全，包括木材仓库、港口、风车磨坊等。生态岛上有木材仓库、南边港口，居民积极投入环保科研，发展可再生能源。
矿岛以金矿井和东边港口为核心，注重资源开发与生态保护平衡。

玩家需充分利用地图设施，发挥各岛特色，为居民创造美好生活。
挑战包括资源紧缺、生态问题等，玩家需采取有效策略应对，如投资绿色科技、与其他岛屿贸易。

生态岛致力于环保科研，拥有一流的研究设施和优秀的科研团队，致力于研发新型能源技术、减少污染排放等。
生态岛将成为该地区环保科技的领导者，为其他岛屿提供技术支持与绿色解决方案。

游戏中，玩家需关注民生福祉、提高生活水平。随着经济体系壮大，产业结构需不断调整优化。
游戏将带领玩家领略三岛风情，欣赏美丽风景，体验充满挑战与机遇的世界。
在这里，玩家将创造一个繁荣、和谐、可持续发展的美好家园。`

export const NPC_INFO = {
  "npcs": [
    {"name": "李风华", "gender": "男", "age": 28, "job": "伐木工", "workAt": "主岛/木材仓库", "liveIn": "主岛/港口北边小屋"},
    {"name": "张梦溪", "gender": "女", "age": 23, "job": "渔夫", "workAt": "主岛/南码头", "liveIn": "主岛/港口北边小屋"},
    {"name": "林静石", "gender": "男", "age": 35, "job": "农民", "workAt": "主岛/农田", "liveIn": "主岛/风磨坊西边的小屋"},
    {"name": "徐天宇", "gender": "男", "age": 24, "job": "磨坊工人", "workAt": "主岛/风磨坊", "liveIn": "主岛/风磨坊西边的小屋"},
    {"name": "王思颖", "gender": "女", "age": 27, "job": "教师", "workAt": "主岛/学校", "liveIn": "主岛/农田北边小屋"},
    {"name": "陈雨萌", "gender": "女", "age": 19, "job": "水井管理员", "workAt": "主岛/水井", "liveIn": "主岛/农田北边小屋"},
    {"name": "赵云锋", "gender": "男", "age": 32, "job": "农民", "workAt": "主岛/农田", "liveIn": "主岛/农田北边小屋"},
    {"name": "郭晓雪", "gender": "女", "age": 22, "job": "畜牧饲养员", "workAt": "主岛/畜牧棚", "liveIn": "主岛/市场南边的小屋"},
    {"name": "刘紫霞", "gender": "女", "age": 29, "job": "商人", "workAt": "主岛/市场", "liveIn": "主岛/市场南边的小屋"},
    {"name": "孙丽娟", "gender": "女", "age": 31, "job": "矿工", "workAt": "主岛/金矿", "liveIn": "主岛/矿井东边的小屋"},
    {"name": "石天泽", "gender": "男", "age": 40, "job": "矿工", "workAt": "主岛/金矿", "liveIn": "主岛/矿井东边的小屋"},
    {"name": "庄子轩", "gender": "男", "age": 18, "job": "船夫", "workAt": "主岛/南码头", "liveIn": "主岛/市场东边的小屋"},
    {"name": "梁晨曦", "gender": "女", "age": 25, "job": "船夫", "workAt": "主岛/东码头", "liveIn": "主岛/市场东边的小屋"},
    {"name": "黄思琪", "gender": "女", "age": 21, "job": "伐木工", "workAt": "生态岛/木材仓库", "liveIn": "主岛/市场东边的小屋"},
    {"name": "胡悠然", "gender": "女", "age": 33, "job": "船夫", "workAt": "生态岛/南码头", "liveIn": "主岛/市场东边的小屋"},
    {"name": "高飞翔", "gender": "男", "age": 26, "job": "矿工", "workAt": "矿岛/金矿", "liveIn": "矿岛/小屋"},
    {"name": "龙晓萍", "gender": "女", "age": 30, "job": "船夫", "workAt": "矿岛/东码头", "liveIn": "矿岛/小屋"}
  ],
  "relations": {
    "李风华": {"mate": "张梦溪", "children": ["李晓晨"], "friends": ["林静石", "高飞翔"]},
    "张梦溪": {"mate": "李风华", "children": ["李晓晨"], "friends": ["陈雨萌", "梁晨曦"]},
    "林静石": {"mate": "徐天宇", "children": ["林梓瑜"], "friends": ["李风华", "赵云锋"]},
    "徐天宇": {"mate": "林静石", "children": ["林梓瑜"], "friends": ["庄子轩", "龙晓萍"]},
    "王思颖": {"mate": "赵云锋", "children": ["赵思源"], "friends": ["孙丽娟", "陈雨萌"]},
    "陈雨萌": {"mate": "", "children": [], "friends": ["王思颖", "张梦溪"]},
    "赵云锋": {"mate": "王思颖", "children": ["赵思源"], "friends": ["林静石", "高飞翔"]},
    "郭晓雪": {"mate": "孙丽娟", "children": [], "friends": ["刘紫霞", "庄子轩"]},
    "刘紫霞": {"mate": "", "children": [], "friends": ["龙晓萍", "郭晓雪"]},
    "孙丽娟": {"mate": "郭晓雪", "children": [], "friends": ["王思颖", "石天泽"]},
    "石天泽": {"mate": "", "children": [], "friends": ["孙丽娟", "高飞翔"]},
    "庄子轩": {"mate": "", "children": [], "friends": ["徐天宇", "郭晓雪"]},
    "梁晨曦": {"mate": "", "children": [], "friends": ["张梦溪", "龙晓萍"]},
    "黄思琪": {"mate": "", "children": [], "friends": ["胡悠然", "高飞翔"]},
    "胡悠然": {"mate": "", "children": [], "friends": ["黄思琪", "梁晨曦"]},
    "高飞翔": {"mate": "", "children": [], "friends": ["石天泽", "李风华"]},
    "龙晓萍": {"mate": "", "children": [], "friends": ["刘紫霞", "梁晨曦"]}
  },
  "skill": {
    "李风华": {"伐木": 8, "捕鱼": 3, "矿工": 5, "农耕": 7, "烹饪": 4, "科研": 1, "管理": 4, "近战": 8, "射击": 3, "社交": 5},
    "张梦溪": {"伐木": 3, "捕鱼": 5, "矿工": 2, "农耕": 4, "烹饪": 7, "科研": 4, "管理": 6, "近战": 5, "射击": 7, "社交": 8},
    "林静石": {"伐木": 6, "捕鱼": 7, "矿工": 3, "农耕": 5, "烹饪": 8, "科研": 2, "管理": 3, "近战": 4, "射击": 9, "社交": 6},
    "徐天宇": {"伐木": 4, "捕鱼": 2, "矿工": 7, "农耕": 6, "烹饪": 5, "科研": 8, "管理": 7, "近战": 3, "射击": 4, "社交": 9},
    "王思颖": {"伐木": 2, "捕鱼": 8, "矿工": 4, "农耕": 3, "烹饪": 6, "科研": 5, "管理": 8, "近战": 2, "射击": 5, "社交": 7},
    "陈雨萌": {"伐木": 5, "捕鱼": 3, "矿工": 8, "农耕": 2, "烹饪": 9, "科研": 6, "管理": 5, "近战": 7, "射击": 6, "社交": 4},
    "赵云锋": {"伐木": 7, "捕鱼": 6, "矿工": 5, "农耕": 8, "烹饪": 3, "科研": 7, "管理": 2, "近战": 6, "射击": 8, "社交": 3},
    "郭晓雪": {"伐木": 3, "捕鱼": 9, "矿工": 6, "农耕": 5, "烹饪": 2, "科研": 8, "管理": 4, "近战": 5, "射击": 7, "社交": 6},
    "刘紫霞": {"伐木": 5, "捕鱼": 4, "矿工": 3, "农耕": 9, "烹饪": 6, "科研": 7, "管理": 5, "近战": 8, "射击": 2, "社交": 7},
    "孙丽娟": {"伐木": 2, "捕鱼": 7, "矿工": 8, "农耕": 6, "烹饪": 3, "科研": 4, "管理": 9, "近战": 4, "射击": 5, "社交": 8},
    "石天泽": {"伐木": 6, "捕鱼": 5, "矿工": 4, "农耕": 7, "烹饪": 8, "科研": 3, "管理": 6, "近战": 9, "射击": 6, "社交": 5},
    "庄子轩": {"伐木": 4, "捕鱼": 8, "矿工": 9, "农耕": 5, "烹饪": 7, "科研": 6, "管理": 3, "近战": 7, "射击": 4, "社交": 6},
    "梁晨曦": {"伐木": 8, "捕鱼": 3, "矿工": 6, "农耕": 4, "烹饪": 5, "科研": 9, "管理": 7, "近战": 3, "射击": 8, "社交": 7},
    "黄思琪": {"伐木": 7, "捕鱼": 4, "矿工": 2, "农耕": 8, "烹饪": 6, "科研": 5, "管理": 8, "近战": 5, "射击": 9, "社交": 4},
    "胡悠然": {"伐木": 3, "捕鱼": 6, "矿工": 7, "农耕": 9, "烹饪": 4, "科研": 8, "管理": 5, "近战": 6, "射击": 3, "社交": 8},
    "高飞翔": {"伐木": 9, "捕鱼": 5, "矿工": 3, "农耕": 6, "烹饪": 7, "科研": 4, "管理": 6, "近战": 8, "射击": 2, "社交": 7},
    "龙晓萍": {"伐木": 4, "捕鱼": 6, "矿工": 8, "农耕": 3, "烹饪": 9, "科研": 7, "管理": 5, "近战": 4, "射击": 6, "社交": 9}
  }
}


// 跨岛需要经过港口，岛内移动直接 lerp
export const MAP_INFO = {
  "locations": [
    {"id": "主岛/木材仓库", "name": "木材仓库1", "pos": {"x": 600, "y": 560}},
    {"id": "主岛/港口北边小屋", "name": "港口北边小屋", "pos": {"x": 694, "y": 652}},
    {"id": "主岛/风磨坊西边的小屋", "name": "磨坊西边的小屋", "pos": {"x": 790, "y": 556}},
    {"id": "主岛/风磨坊", "name": "风车磨坊", "pos": {"x": 838, "y": 554}},
    {"id": "主岛/学校", "name": "学校", "pos": {"x": 908, "y": 550}},
    {"id": "主岛/水井", "name": "水井", "pos": {"x": 888, "y": 602}},
    {"id": "主岛/农田", "name": "农田", "pos": {"x": 792, "y": 696}},
    {"id": "主岛/农田北边小屋", "name": "农田北边的小屋", "pos": {"x": 790, "y": 648}},
    {"id": "主岛/畜牧棚", "name": "畜牧棚", "pos": {"x": 840, "y": 648}},
    {"id": "主岛/市场", "name": "市场", "pos": {"x": 936, "y": 650}},
    {"id": "主岛/市场南边的小屋", "name": "市场南边的小屋", "pos": {"x": 934, "y": 698}},
    {"id": "主岛/市场东边的小屋", "name": "市场东边的小屋", "pos": {"x": 1030, "y": 602}},
    {"id": "主岛/矿井东边的小屋", "name": "矿井东边的小屋", "pos": {"x": 1080, "y": 408}},
    {"id": "主岛/金矿", "name": "主岛金矿", "pos": {"x": 930, "y": 458}},
    {"id": "主岛/南码头", "name": "主岛南边港口", "pos": {"x": 694, "y": 738}},
    {"id": "主岛/东码头", "name": "主岛东边港口", "pos": {"x": 1222, "y": 514}},
    {"id": "生态岛/木材仓库", "name": "生态岛木材仓库", "pos": {"x": 1464, "y": 404}},
    {"id": "生态岛/南码头", "name": "生态岛南边港口", "pos": {"x": 1462, "y": 550}},
    {"id": "矿岛/金矿", "name": "矿岛金矿井", "pos": {"x": 1748, "y": 842}},
    {"id": "矿岛/小屋", "name": "矿岛小屋", "pos": {"x": 1706, "y": 934}},
    {"id": "矿岛/东码头", "name": "矿岛东边港口", "pos": {"x": 1844, "y": 928}},
  ],
  "paths": [
    {
      "id": "主岛--生态岛",
      "name": "主岛到生态岛",
      "locations": ["主岛/东码头", "生态岛/南码头"],
      "points": [
        {"x": 1222, "y": 514}, {"x": 1270, "y": 498}, {"x": 1274, "y": 564}, {"x": 1462, "y": 550}
      ]
    },
    {
      "id": "主岛--矿岛",
      "name": "主岛到矿岛",
      "locations": ["主岛/南码头", "矿岛/东码头"],
      "points": [
        {"x": 694, "y": 738}, {"x": 784, "y": 1088}, {"x": 1842, "y": 1088}, {"x": 1462, "y": 550}
      ]
    },
    {
      "id": "生态岛--矿岛",
      "name": "生态岛到矿岛",
      "locations": ["生态岛/南码头", "矿岛/东码头"],
      "points": [
        {"x": 1462, "y": 550}, {"x": 1468, "y": 690}, {"x": 1482, "y": 684}, {"x": 1462, "y": 550}
      ]
    },
  ]
}
